cpp.org
#+TITLE: Note of "A Tour of C++"
#+OPTIONS: toc:2 num:3 H:4 ^:nil pri:t
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="org.css" />

* The Basics
The minimal C++ program:
#+BEGIN_SRC C++
int main() { }
#+END_SRC

If no value is returned, the system will receive a value
indicating successful completion.

A function declaration may contain argument names.
#+BEGIN_SRC C++
double square(double); // return the square of the argument
#+END_SRC

If two functions are defined with the same name,
 but with different argument types,
 the compiler will choose the most appropriate function to invoke for each call.

Fundamental types: bool, char, int, double, unsigned.

| type       | sizeof |
|------------+--------|
| bool, char |      1 |
| int        |      4 |
| double     |      8 |

/The usual arithmetic conversions: expressions
 are computed at the highest precision of its operands./

Universal form based on curly-brace-delimited initializer lists:
#+BEGIN_SRC C++
  double d2 {2.3};
  complex<double> z3 = {1,2}; // the = is optional with { ... }
#+END_SRC

=auto=:
#+BEGIN_SRC c++
auto b = true;
#+END_SRC

/Range-for-statement/:
#+BEGIN_SRC c++
int v[] = {0,1,2,3,4,5,6,7,8,9};
for (auto& x : v) cout << x << '\n';
#+END_SRC

Use =nullptr= rather than =0= or =NULL=.

Prefer the ={}=-initializer syntax for declarations with a named type,
prefer the === syntax for the initialization in declarations using =auto=.

* User-Defined Types
A =struct= is simply a class with members public by default:
#+BEGIN_SRC c++
struct V{ int val; };
#+END_SRC

Class:
#+BEGIN_SRC c++
  class Vector {
  public:
    Vector(int s) : elem{new double[s]}, sz{s} {} // member initializer list
    double &operator[](int i) { return elem[i]; } // operation
    int size() { return sz; }

  private:
    double* elem;
    int sz;
  };
#+END_SRC

A =union= is a =struct= in which all members are allocated at the same address
so that the =union= occupies only as much space as its largest member.
Naturally, a =union= can hold a value for only one member at a time.
#+BEGIN_SRC c++
  union Value {
    char* s;
    int i;
  };
#+END_SRC


Enumeration:
#+BEGIN_SRC c++
enum class Color { red, blue, green };
Color col = Color::red;
#+END_SRC

An enumeration is a user-defined type so we can define operators for it.
You can remove the =class= from =enum= class to get a plain =enum=
(=int= value starts with 0).

* Modularity

Declarations / interfaces, =Vector.h=:
#+BEGIN_SRC c++
  class Vector {
  public:
    Vector(int s);
    double& operator[](int i);
    int size();
  private:
    double* elem;
  };
#+END_SRC

Avoid non-inline function definitions in headers.

Definitions / implementations, =Vector.cpp=:
#+BEGIN_SRC c++
  #include "Vector.h"
  Vector::Vector(int s) :elem{new double[s]}, sz{s} { }
  double& Vector::operator[](int i) { return elem[i]; }
  int Vector::size() { return sz; }
#+END_SRC

Namespaces:
#+BEGIN_SRC c++
  namespace My_code {
    class complex {
      // ...
    };
    complex sqrt(complex);
    // ...
    int main();
  }
  int My_code::main(){
    // ...
  };
#+END_SRC

Don't put a using-directive in a header file.

Exceptions:
#+BEGIN_SRC c++
  #include<stdexcept>
  throw out_of_range{"Vector::operator[]"};

  try { /* ... */ }
  catch (out_of_range) { /* ... */ }
  catch (...) { /* any exception */ }
#+END_SRC

Logic errors: =logic_error=, =domain_error=, =invalid_argument=, =length_error=, =out_of_range=.

Runtime errors: =runtime_error=, =range_error=, =overflow_error=, =underflow_error=.

A function that should never throw an exception can be declared noexcept:
#+BEGIN_SRC c++
void user(int sz) noexcept;
#+END_SRC

If still throws, the standard-library function =terminate()=
 is called to immediately terminate the program.

If operator =new= can't find memory to allocate, it throws a =std::bad_alloc=:
#+BEGIN_SRC c++
  try { /* ... */ }
  catch (std::bad_alloc) {
    std::terminate(); // handle memory exhaustion
  }
#+END_SRC

To rethrow the exception, we simply write =throw=:
#+BEGIN_SRC c++
  catch (std::length_error) {
    cout << "test failed: length error\n";
    throw; // rethrow
  }
#+END_SRC

Compile time check:
#+BEGIN_SRC c++
  static_assert(4 <= sizeof(int), "integers are too small");
#+END_SRC

