cpp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-14 Wed 17:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Note of "A Tour of C++"</title>
<meta name="author" content="scturtle" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Note of "A Tour of C++"</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb61a0d9">1. The Basics</a></li>
<li><a href="#orgdf736dd">2. User-Defined Types</a></li>
<li><a href="#org6751b88">3. Modularity</a></li>
<li><a href="#orgb397c8d">4. Classes</a>
<ul>
<li><a href="#org3c9e62a">4.1. Dynamic Casting</a></li>
<li><a href="#orgf827a50">4.2. Copy and Move</a></li>
<li><a href="#orgcda26a1">4.3. Essential Operations</a></li>
</ul>
</li>
<li><a href="#org59276ab">5. Templates</a></li>
<li><a href="#orgf02dc4f">6. Library Overview</a></li>
<li><a href="#orgc8c873e">7. Strings and Regular Expressions</a>
<ul>
<li><a href="#org0649632">7.1. Regular Expressions</a></li>
</ul>
</li>
<li><a href="#org219a6d5">8. I/O Streams</a></li>
<li><a href="#orgee115ba">9. Containers</a></li>
<li><a href="#org7f6a9d2">10. Algorithms</a></li>
<li><a href="#org451364d">11. Utilities</a>
<ul>
<li><a href="#org5db590c">11.1. Smart Pointers</a></li>
<li><a href="#org1e09671">11.2. Specialized Containers</a></li>
</ul>
</li>
<li><a href="#org04a31e7">12. Numerics</a></li>
<li><a href="#org92a1b7a">13. Concurrency</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb61a0d9" class="outline-2">
<h2 id="orgb61a0d9"><span class="section-number-2">1.</span> The Basics</h2>
<div class="outline-text-2" id="text-1">
<p>
The minimal C++ program:
</p>
<div class="org-src-container">
<pre class="src src-C++">int main() { }
</pre>
</div>

<p>
If no value is returned, the system will receive a value
indicating successful completion.
</p>

<p>
A function declaration may contain argument names.
</p>
<div class="org-src-container">
<pre class="src src-C++">double square(double); // return the square of the argument
</pre>
</div>

<p>
If two functions are defined with the same name,
 but with different argument types,
 the compiler will choose the most appropriate function to invoke for each call.
</p>

<p>
Fundamental types: bool, char, int, double, unsigned.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">type</th>
<th scope="col" class="org-right">sizeof</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">bool, char</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">int</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">double</td>
<td class="org-right">8</td>
</tr>
</tbody>
</table>

<p>
<i>The usual arithmetic conversions: expressions
 are computed at the highest precision of its operands.</i>
</p>

<p>
Universal form based on curly-brace-delimited initializer lists:
</p>
<div class="org-src-container">
<pre class="src src-C++">  double d2 {2.3};
  complex&lt;double&gt; z3 = {1,2}; // the = is optional with { ... }
</pre>
</div>

<p>
<code>auto</code>:
</p>
<div class="org-src-container">
<pre class="src src-c++">auto b = true;
</pre>
</div>

<p>
<i>Range-for-statement</i>:
</p>
<div class="org-src-container">
<pre class="src src-c++">int v[] = {0,1,2,3,4,5,6,7,8,9};
for (auto&amp; x : v) cout &lt;&lt; x &lt;&lt; '\n';
</pre>
</div>

<p>
Use <code>nullptr</code> rather than <code>0</code> or <code>NULL</code>.
</p>

<p>
Prefer the <code>{}</code>-initializer syntax for declarations with a named type,
prefer the <code>=</code> syntax for the initialization in declarations using <code>auto</code>.
</p>
</div>
</div>

<div id="outline-container-orgdf736dd" class="outline-2">
<h2 id="orgdf736dd"><span class="section-number-2">2.</span> User-Defined Types</h2>
<div class="outline-text-2" id="text-2">
<p>
A <code>struct</code> is simply a class with members public by default:
</p>
<div class="org-src-container">
<pre class="src src-c++">struct V{ int val; };
</pre>
</div>

<p>
Class:
</p>
<div class="org-src-container">
<pre class="src src-c++">  class Vector {
  public:
    Vector(int s) : elem{new double[s]}, sz{s} {} // member initializer list
    double &amp;operator[](int i) { return elem[i]; } // operation
    int size() { return sz; }

  private:
    double* elem;
    int sz;
  };
</pre>
</div>

<p>
A <code>union</code> is a <code>struct</code> in which all members are allocated at the same address
so that the <code>union</code> occupies only as much space as its largest member.
Naturally, a <code>union</code> can hold a value for only one member at a time.
</p>
<div class="org-src-container">
<pre class="src src-c++">  union Value {
    char* s;
    int i;
  };
</pre>
</div>


<p>
Enumeration:
</p>
<div class="org-src-container">
<pre class="src src-c++">enum class Color { red, blue, green };
Color col = Color::red;
</pre>
</div>

<p>
An enumeration is a user-defined type so we can define operators for it.
You can remove the <code>class</code> from <code>enum</code> class to get a plain <code>enum</code>
(<code>int</code> value starts with 0).
</p>
</div>
</div>

<div id="outline-container-org6751b88" class="outline-2">
<h2 id="org6751b88"><span class="section-number-2">3.</span> Modularity</h2>
<div class="outline-text-2" id="text-3">
<p>
Declarations / interfaces, <code>Vector.h</code>:
</p>
<div class="org-src-container">
<pre class="src src-c++">  class Vector {
  public:
    Vector(int s);
    double&amp; operator[](int i);
    int size();
  private:
    double* elem;
  };
</pre>
</div>

<p>
Avoid non-inline function definitions in headers.
</p>

<p>
Definitions / implementations, <code>Vector.cpp</code>:
</p>
<div class="org-src-container">
<pre class="src src-c++">  #include "Vector.h"
  Vector::Vector(int s) :elem{new double[s]}, sz{s} { }
  double&amp; Vector::operator[](int i) { return elem[i]; }
  int Vector::size() { return sz; }
</pre>
</div>

<p>
Namespaces:
</p>
<div class="org-src-container">
<pre class="src src-c++">  namespace My_code {
    class complex {
      // ...
    };
    complex sqrt(complex);
    // ...
    int main();
  }
  int My_code::main(){
    // ...
  };
</pre>
</div>

<p>
Don't put a using-directive in a header file.
</p>

<p>
Exceptions:
</p>
<div class="org-src-container">
<pre class="src src-c++">  #include&lt;stdexcept&gt;
  throw out_of_range{"Vector::operator[]"};

  try { /* ... */ }
  catch (out_of_range) { /* ... */ }
  catch (...) { /* any exception */ }
</pre>
</div>

<p>
Logic errors: <code>logic_error</code>, <code>domain_error</code>, <code>invalid_argument</code>, <code>length_error</code>, <code>out_of_range</code>.
</p>

<p>
Runtime errors: <code>runtime_error</code>, <code>range_error</code>, <code>overflow_error</code>, <code>underflow_error</code>.
</p>

<p>
A function that should never throw an exception can be declared noexcept:
</p>
<div class="org-src-container">
<pre class="src src-c++">void user(int sz) noexcept;
</pre>
</div>

<p>
If still throws, the standard-library function <code>terminate()</code>
 is called to immediately terminate the program.
</p>

<p>
If operator <code>new</code> can't find memory to allocate, it throws a <code>std::bad_alloc</code>:
</p>
<div class="org-src-container">
<pre class="src src-c++">  try { /* ... */ }
  catch (std::bad_alloc) {
    std::terminate(); // handle memory exhaustion
  }
</pre>
</div>

<p>
To rethrow the exception, we simply write <code>throw</code>:
</p>
<div class="org-src-container">
<pre class="src src-c++">  catch (std::length_error) {
    cout &lt;&lt; "test failed: length error\n";
    throw; // rethrow
  }
</pre>
</div>

<p>
Compile time check:
</p>
<div class="org-src-container">
<pre class="src src-c++">  static_assert(4 &lt;= sizeof(int), "integers are too small");
</pre>
</div>
</div>
</div>
