cpp.org
* Classes
=const= function:
#+BEGIN_SRC c++
  double real() const { return re; }
#+END_SRC

Operations change object itself should return reference:
#+BEGIN_SRC c++
  complex& operator+=(complex z) { re+=z.re, im+=z.im; return *this; }
#+END_SRC

Functions defined in a class are inlined by default.
It is possible to explicitly require inlining by
preceeding a function declaration with the keyword =inline=.

Clever ways of implementing operations:
#+BEGIN_SRC c++
  complex operator−(complex a, complex b) { return a −= b; }
  // unary minus
  complex operator−(complex a) { return {−a.real(), −a.imag()}; }
#+END_SRC

Destructor:
#+BEGIN_SRC c++
  ~Vector() { delete[] elem; }
#+END_SRC

Initializer-list constructor:
#+BEGIN_SRC c++
  Vector::Vector(std::initializer_list<double> lst)
      : elem{new double[lst.size()]}, sz{static_cast<int>(lst.size())} {
    copy(lst.begin(), lst.end(), elem);
  }
#+END_SRC

=push_back=:
#+BEGIN_SRC c++
  Vector read(istream &is) {
    Vector v;
    for (double d; is >> d;)
      v.push_back(d);
    return v;
  }
#+END_SRC

Abstract type:
#+BEGIN_SRC c++
  class Container {
  public:
    // pure virtual function
    virtual double &operator[](int) = 0;
    // const member function
    virtual int size() const = 0;
    // destructor
    virtual  ~Container() {}
  };
#+END_SRC

The word =virtual= means "may be redefined later in a class derived from this one."

The curious ==0= syntax says the function is pure virtual;
that is, some class derived from =Container= *must* define the function.

A class with a pure virtual function is called an abstract class
and it's not possible to define an object of it.

As is common for abstract class, it does *not* have a constructor.
On the other hand, it *does* have a destructor and that destructor is =virtual=.

#+BEGIN_SRC c++
  class Vector_container : public Container {
    Vector v;

  public:
    Vector_container(int s) : v(s) {}
    ~Vector_container() {}
    double &operator[](int i) { return v[i]; }
    int size() const { return v.size(); }
  };
#+END_SRC

Note that the member destructor (=~Vector()=) is implicitly invoked
by its class's destructor (=~Vector_container()=).

Virtual function table (=vtbl=).

A function in a derived class overrides a virtual function
in a base class if that function has exactly the same name and type.

A function with a slightly different name or a slightly different type
may be intended to override or it may be intended to be a separate function.

Explicitly state that a function is meant to override:
#+BEGIN_SRC c++
  void move(Point to) override;
#+END_SRC

** Dynamic Casting

Dynamic casting:
#+BEGIN_SRC c++
  if (Smiley* p = dynamic_cast<Smiley*>(ps)) { /* ... */ }
#+END_SRC
If the object pointed to by the argument of =dynamic_cast=
is not of the expected type or a class derived from the expected type,
=dynamic_cast= returns =nullptr=.

When a different type is unacceptable, we can simply =dynamic_cast= to a reference type.
If the object is not of the expected type, =bad_cast= is thrown:
#+BEGIN_SRC c++
  Smiley &r{dynamic_cast<Smiley &>(*ps)};
#+END_SRC

Better resource handling: return =unique_ptr= rather than
a naked pointer and store =unique_ptrs= in the container:
#+BEGIN_SRC c++
  vector<unique_ptr<Shape>> v;
  v.push_back(unique_ptr<Shape>{new Circle{p, r}});
#+END_SRC

Now the object is owned by the =unique_ptr= which will delete the object
when it is no longer needed, that is, when its =unique_ptr= goes out of scope.

** Copy and Move

By default, objects can be copied.
The default meaning of copy is memberwise copy: copy each member.

#+BEGIN_SRC c++
  complex z2{z1}; // copy initialization
  complex z3;
  z3 = z2;        // copy assignment
#+END_SRC

Copy constructor and copy assignment:
#+BEGIN_SRC c++
  Vector(const Vector &a);            // copy constructor
  Vector &operator=(const Vector &a); // copy assignment

  Vector::Vector(const Vector &a) : elem{new double[a.sz]}, sz{a.sz} {
    for (int i = 0; i != sz; ++i)
      elem[i] = a.elem[i];
  }

  Vector &Vector::operator=(const Vector &a) {
    double* p = new double[a.sz];
    for (int i = 0; i != a.sz; ++i)
      p[i] = a.elem[i];
    delete[] elem; // delete old elements
    elem = p;
    sz = a.sz;
    return *this;
  }
#+END_SRC

To avoid copying in returning value:
#+BEGIN_SRC c++
  Vector foo(/* ... */) {
    Vector res;
    // ...
    return res;
  }

#+END_SRC

Move constructor and move assignment should be implemented:
#+BEGIN_SRC c++
  Vector(Vector &&a);            // move constructor
  Vector &operator=(Vector &&a); // move assignment

  Vector::Vector(Vector &&a)
      : elem{a.elem}, sz{a.sz} { // "grab the elements" from a
    a.elem = nullptr; a.sz = 0;  // now a has no elements
  }
#+END_SRC

The =&&= means /rvalue/ reference and is a reference to which we can bind an rvalue.
The word "rvalue" is intended to complement "lvalue," which roughly means
"something that can appear on the left-hand side of an assignment."
So an *rvalue* is – to a first approximation – *a value that you can't assign to*,
such as an integer returned by a function call.
Thus, an rvalue reference is a reference to something that nobody else can assign to,
so that we can safely "steal" its value.

A move operation is applied when an rvalue reference is used
as an initializer or as the right-hand side of an assignment.

Manually move with =std::move=:
#+BEGIN_SRC c++
  Vector f() {
    // ...
    z = x;            // we get a copy
    y = std::move(x); // we get a move
    return z;         // we get a move
  }
#+END_SRC


