cpp.html

<div id="outline-container-orgb397c8d" class="outline-2">
<h2 id="orgb397c8d"><span class="section-number-2">4.</span> Classes</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>const</code> function:
</p>
<div class="org-src-container">
<pre class="src src-c++">  double real() const { return re; }
</pre>
</div>

<p>
Operations change object itself should return reference:
</p>
<div class="org-src-container">
<pre class="src src-c++">  complex&amp; operator+=(complex z) { re+=z.re, im+=z.im; return *this; }
</pre>
</div>

<p>
Functions defined in a class are inlined by default.
It is possible to explicitly require inlining by
preceeding a function declaration with the keyword <code>inline</code>.
</p>

<p>
Clever ways of implementing operations:
</p>
<div class="org-src-container">
<pre class="src src-c++">  complex operator−(complex a, complex b) { return a −= b; }
  // unary minus
  complex operator−(complex a) { return {−a.real(), −a.imag()}; }
</pre>
</div>

<p>
Destructor:
</p>
<div class="org-src-container">
<pre class="src src-c++">  ~Vector() { delete[] elem; }
</pre>
</div>

<p>
Initializer-list constructor:
</p>
<div class="org-src-container">
<pre class="src src-c++">  Vector::Vector(std::initializer_list&lt;double&gt; lst)
      : elem{new double[lst.size()]}, sz{static_cast&lt;int&gt;(lst.size())} {
    copy(lst.begin(), lst.end(), elem);
  }
</pre>
</div>

<p>
<code>push_back</code>:
</p>
<div class="org-src-container">
<pre class="src src-c++">  Vector read(istream &amp;is) {
    Vector v;
    for (double d; is &gt;&gt; d;)
      v.push_back(d);
    return v;
  }
</pre>
</div>

<p>
Abstract type:
</p>
<div class="org-src-container">
<pre class="src src-c++">  class Container {
  public:
    // pure virtual function
    virtual double &amp;operator[](int) = 0;
    // const member function
    virtual int size() const = 0;
    // destructor
    virtual  ~Container() {}
  };
</pre>
</div>

<p>
The word <code>virtual</code> means "may be redefined later in a class derived from this one."
</p>

<p>
The curious <code>=0</code> syntax says the function is pure virtual;
that is, some class derived from <code>Container</code> <b>must</b> define the function.
</p>

<p>
A class with a pure virtual function is called an abstract class
and it's not possible to define an object of it.
</p>

<p>
As is common for abstract class, it does <b>not</b> have a constructor.
On the other hand, it <b>does</b> have a destructor and that destructor is <code>virtual</code>.
</p>

<div class="org-src-container">
<pre class="src src-c++">  class Vector_container : public Container {
    Vector v;

  public:
    Vector_container(int s) : v(s) {}
    ~Vector_container() {}
    double &amp;operator[](int i) { return v[i]; }
    int size() const { return v.size(); }
  };
</pre>
</div>

<p>
Note that the member destructor (<code>~Vector()</code>) is implicitly invoked
by its class's destructor (<code>~Vector_container()</code>).
</p>

<p>
Virtual function table (<code>vtbl</code>).
</p>

<p>
A function in a derived class overrides a virtual function
in a base class if that function has exactly the same name and type.
</p>

<p>
A function with a slightly different name or a slightly different type
may be intended to override or it may be intended to be a separate function.
</p>

<p>
Explicitly state that a function is meant to override:
</p>
<div class="org-src-container">
<pre class="src src-c++">  void move(Point to) override;
</pre>
</div>
</div>

<div id="outline-container-org3c9e62a" class="outline-3">
<h3 id="org3c9e62a"><span class="section-number-3">4.1.</span> Dynamic Casting</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Dynamic casting:
</p>
<div class="org-src-container">
<pre class="src src-c++">  if (Smiley* p = dynamic_cast&lt;Smiley*&gt;(ps)) { /* ... */ }
</pre>
</div>
<p>
If the object pointed to by the argument of <code>dynamic_cast</code>
is not of the expected type or a class derived from the expected type,
<code>dynamic_cast</code> returns <code>nullptr</code>.
</p>

<p>
When a different type is unacceptable, we can simply <code>dynamic_cast</code> to a reference type.
If the object is not of the expected type, <code>bad_cast</code> is thrown:
</p>
<div class="org-src-container">
<pre class="src src-c++">  Smiley &amp;r{dynamic_cast&lt;Smiley &amp;&gt;(*ps)};
</pre>
</div>

<p>
Better resource handling: return <code>unique_ptr</code> rather than
a naked pointer and store <code>unique_ptrs</code> in the container:
</p>
<div class="org-src-container">
<pre class="src src-c++">  vector&lt;unique_ptr&lt;Shape&gt;&gt; v;
  v.push_back(unique_ptr&lt;Shape&gt;{new Circle{p, r}});
</pre>
</div>

<p>
Now the object is owned by the <code>unique_ptr</code> which will delete the object
when it is no longer needed, that is, when its <code>unique_ptr</code> goes out of scope.
</p>
</div>
</div>

<div id="outline-container-orgf827a50" class="outline-3">
<h3 id="orgf827a50"><span class="section-number-3">4.2.</span> Copy and Move</h3>
<div class="outline-text-3" id="text-4-2">
<p>
By default, objects can be copied.
The default meaning of copy is memberwise copy: copy each member.
</p>

<div class="org-src-container">
<pre class="src src-c++">  complex z2{z1}; // copy initialization
  complex z3;
  z3 = z2;        // copy assignment
</pre>
</div>

<p>
Copy constructor and copy assignment:
</p>
<div class="org-src-container">
<pre class="src src-c++">  Vector(const Vector &amp;a);            // copy constructor
  Vector &amp;operator=(const Vector &amp;a); // copy assignment

  Vector::Vector(const Vector &amp;a) : elem{new double[a.sz]}, sz{a.sz} {
    for (int i = 0; i != sz; ++i)
      elem[i] = a.elem[i];
  }

  Vector &amp;Vector::operator=(const Vector &amp;a) {
    double* p = new double[a.sz];
    for (int i = 0; i != a.sz; ++i)
      p[i] = a.elem[i];
    delete[] elem; // delete old elements
    elem = p;
    sz = a.sz;
    return *this;
  }
</pre>
</div>

<p>
To avoid copying in returning value:
</p>
<div class="org-src-container">
<pre class="src src-c++">  Vector foo(/* ... */) {
    Vector res;
    // ...
    return res;
  }

</pre>
</div>

<p>
Move constructor and move assignment should be implemented:
</p>
<div class="org-src-container">
<pre class="src src-c++">  Vector(Vector &amp;&amp;a);            // move constructor
  Vector &amp;operator=(Vector &amp;&amp;a); // move assignment

  Vector::Vector(Vector &amp;&amp;a)
      : elem{a.elem}, sz{a.sz} { // "grab the elements" from a
    a.elem = nullptr; a.sz = 0;  // now a has no elements
  }
</pre>
</div>

<p>
The <code>&amp;&amp;</code> means <i>rvalue</i> reference and is a reference to which we can bind an rvalue.
The word "rvalue" is intended to complement "lvalue," which roughly means
"something that can appear on the left-hand side of an assignment."
So an <b>rvalue</b> is – to a first approximation – <b>a value that you can't assign to</b>,
such as an integer returned by a function call.
Thus, an rvalue reference is a reference to something that nobody else can assign to,
so that we can safely "steal" its value.
</p>

<p>
A move operation is applied when an rvalue reference is used
as an initializer or as the right-hand side of an assignment.
</p>

<p>
Manually move with <code>std::move</code>:
</p>
<div class="org-src-container">
<pre class="src src-c++">  Vector f() {
    // ...
    z = x;            // we get a copy
    y = std::move(x); // we get a move
    return z;         // we get a move
  }
</pre>
</div>
</div>
</div>
