cpp.org
** Essential Operations

#+BEGIN_SRC c++
  class X {
  public:
    X(Sometype);             // ordinary constructor: create an object
    X();                     // default constructor
    X(const X &);            // copy constructor
    X(X &&);                 // move constructor
    X &operator=(const X &); // copy assignment: clean up target and copy
    X &operator=(X &&);      // move assignment: clean up target and move
    ~X();                    // destructor: clean up
    // ...
  };
#+END_SRC

Except for the ordinary constructor, these can be generated by compiler:
#+BEGIN_SRC c++
  class Y {
  public:
    Y(Sometype);
    Y(const Y &) = default; // I really want the default copy constructor
    Y(Y &&) = default;      // I really want the default copy constructor
    // ...
  };
#+END_SRC

If you are explicit about some defaults,
other default definitions will not be generated.

Eliminate the default definitions of those two operations:
#+BEGIN_SRC c++
  class Shape {
  public:
    // no copy operations
    Shape(const Shape &) = delete;
    Shape &operator=(const Shape &) = delete;
    // no move operations
    Shape(Shape &&) = delete;
    Shape &operator=(Shape &&) = delete;
    ~Shape();
    // ...
  };
#+END_SRC

A constructor taking a single argument defines a conversion from its argument type,
but if only =explicit= conversion is allowed:
#+BEGIN_SRC c++
  class Vector {
  public:
    explicit Vector(int s); // no implicit conversion from int to Vector
    // ...
  };
#+END_SRC

/C++ also offers a garbage collection interface
 so that you can plug in a garbage collector./

In the C++ standard library, RAII (Resource Acquisition Is Initialization) is pervasive:
 for example, memory (string, vector, map, =unordered_map=, etc.),
 files (ifstream, ofstream, etc.), threads (thread), locks (=lock_guard=, =unique_lock=, etc.),
 and general objects (through =unique_ptr= and =shared_ptr=).

* Templates
#+BEGIN_SRC c++
  template<typename T>
  class Vector {
  private:
    T* elem;
    // ...
  }
  Vector<T>::Vector(int s) { // ...
#+END_SRC

Using =class= to introduce a type parameter is equivalent to using =typename=,
and in older code we often see =template<class T>= as the prefix.

The =>>= in =Vector<list<int>>= terminates the nested template arguments;
it is not a misplaced input operator.
It is not (as in C++98) necessary to place a space between the two >s.

Provide =begin()= and =end()= to support =range-for=:
#+BEGIN_SRC c++
  template <typename T>
  T *begin(Vector<T> &x) {
    // pointer to first element or nullptr
    return x.size() ? &x[0] : nullptr;
  }
  template <typename T>
  T *end(Vector<T> &x) {
    // pointer to one-past-last element
    return begin(x) + x.size();
  }
  void f2(Vector<string> &vs) {
    for (auto &s : vs)
      cout << s << '\n';
  }
#+END_SRC

Templates are a compile-time mechanism,
so their use incurs no run-time overhead compared to hand-crafted code.

A template can take value arguments:
#+BEGIN_SRC c++
  template<typename T, int N>
  struct Buffer {
    using value_type = T;
    constexpr int size() { return N; }
    T[N];
    // ...
  };
#+END_SRC

The alias =value_type= and the =constexpr= function are provided
to allow users (read-only) access to the template arguments.

Can be used to create arbitrarily sized buffers on stack:
#+BEGIN_SRC c++
  Buffer<char,1024> glob;
#+END_SRC

Function object: objects that can be called like functions:
#+BEGIN_SRC c++
  template<typename T>
  class Less_than {
    const T val; // value to compare against
  public:
    Less_than(const T &v) : val(v) {}
    bool operator()(const T &x) const { return x < val; } // call operator
  };

  count(vec, Less_than<int>{x});
#+END_SRC

Lambda expression:
#+BEGIN_SRC c++
  count(vec, [&](int a) { return a < x; });
#+END_SRC

Capture nothing is =[ ]= , capture all local names used by reference is =[&]= ,
 and capture all local names used by value is =[=]= .

Had we wanted to capture only x, we could have said so: =[&x]= .
Had we wanted to give the generated object a copy of x,
we could have said so: =[=x]= .

Variadic templates:
#+BEGIN_SRC c++
  void f() { } // do nothing
  template<typename T, typename... Tail>
  void f(T head, Tail... tail) {
    g(head);    // do something to head
    f(tail...); // try again with tail
  }
#+END_SRC

Another example in chapter 11:
#+BEGIN_SRC c++
  template <typename T, typename... Args>
  unique_ptr<T> make_unique(Args &&... args) {
    return std::unique_ptr<T>{new T{std::forward<Args>(args)...}};
  }
#+END_SRC

Aliases:
#+BEGIN_SRC c++
  // in <cstddef>
  using size_t = unsigned int;
#+END_SRC

It is very common for a parameterized type to provide
an alias for types related to their template arguments.
#+BEGIN_SRC c++
  template<typename T>
  class Vector {
  public:
    using value_type = T;
    // ...
  };
#+END_SRC

In fact, every standard-library container provides
=value_type= as the name of its value type.
#+BEGIN_SRC c++
  template <typename C>
  using Element_type = typename C::value_type;

  template <typename Container>
  void algo(Container &c) {
    Vector<Element_type<Container>> vec;
    // ...
  }
#+END_SRC

A function template argument needs to be explicitly mentioned
only if it cannot be deduced or if there is no default:
#+BEGIN_SRC c++
  template <typename Target = string, typename Source = string>
  Target to(Source arg) {
    // ...
  }
  int main() {
    auto x1 = to<string, double>(1.2);
    auto x2 = to<string>(1.2); // Source is deduced to double
    auto x3 = to<>(1.2);
    auto x4 = to(1.2);
  }
#+END_SRC

