cpp.html


<div id="outline-container-orgcda26a1" class="outline-3">
<h3 id="orgcda26a1"><span class="section-number-3">4.3.</span> Essential Operations</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-c++">  class X {
  public:
    X(Sometype);             // ordinary constructor: create an object
    X();                     // default constructor
    X(const X &amp;);            // copy constructor
    X(X &amp;&amp;);                 // move constructor
    X &amp;operator=(const X &amp;); // copy assignment: clean up target and copy
    X &amp;operator=(X &amp;&amp;);      // move assignment: clean up target and move
    ~X();                    // destructor: clean up
    // ...
  };
</pre>
</div>

<p>
Except for the ordinary constructor, these can be generated by compiler:
</p>
<div class="org-src-container">
<pre class="src src-c++">  class Y {
  public:
    Y(Sometype);
    Y(const Y &amp;) = default; // I really want the default copy constructor
    Y(Y &amp;&amp;) = default;      // I really want the default copy constructor
    // ...
  };
</pre>
</div>

<p>
If you are explicit about some defaults,
other default definitions will not be generated.
</p>

<p>
Eliminate the default definitions of those two operations:
</p>
<div class="org-src-container">
<pre class="src src-c++">  class Shape {
  public:
    // no copy operations
    Shape(const Shape &amp;) = delete;
    Shape &amp;operator=(const Shape &amp;) = delete;
    // no move operations
    Shape(Shape &amp;&amp;) = delete;
    Shape &amp;operator=(Shape &amp;&amp;) = delete;
    ~Shape();
    // ...
  };
</pre>
</div>

<p>
A constructor taking a single argument defines a conversion from its argument type,
but if only <code>explicit</code> conversion is allowed:
</p>
<div class="org-src-container">
<pre class="src src-c++">  class Vector {
  public:
    explicit Vector(int s); // no implicit conversion from int to Vector
    // ...
  };
</pre>
</div>

<p>
<i>C++ also offers a garbage collection interface
 so that you can plug in a garbage collector.</i>
</p>

<p>
In the C++ standard library, RAII (Resource Acquisition Is Initialization) is pervasive:
 for example, memory (string, vector, map, <code>unordered_map</code>, etc.),
 files (ifstream, ofstream, etc.), threads (thread), locks (<code>lock_guard</code>, <code>unique_lock</code>, etc.),
 and general objects (through <code>unique_ptr</code> and <code>shared_ptr</code>).
</p>
</div>
</div>
</div>

<div id="outline-container-org59276ab" class="outline-2">
<h2 id="org59276ab"><span class="section-number-2">5.</span> Templates</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-c++">  template&lt;typename T&gt;
  class Vector {
  private:
    T* elem;
    // ...
  }
  Vector&lt;T&gt;::Vector(int s) { // ...
</pre>
</div>

<p>
Using <code>class</code> to introduce a type parameter is equivalent to using <code>typename</code>,
and in older code we often see <code>template&lt;class T&gt;</code> as the prefix.
</p>

<p>
The <code>&gt;&gt;</code> in <code>Vector&lt;list&lt;int&gt;&gt;</code> terminates the nested template arguments;
it is not a misplaced input operator.
It is not (as in C++98) necessary to place a space between the two &gt;s.
</p>

<p>
Provide <code>begin()</code> and <code>end()</code> to support <code>range-for</code>:
</p>
<div class="org-src-container">
<pre class="src src-c++">  template &lt;typename T&gt;
  T *begin(Vector&lt;T&gt; &amp;x) {
    // pointer to first element or nullptr
    return x.size() ? &amp;x[0] : nullptr;
  }
  template &lt;typename T&gt;
  T *end(Vector&lt;T&gt; &amp;x) {
    // pointer to one-past-last element
    return begin(x) + x.size();
  }
  void f2(Vector&lt;string&gt; &amp;vs) {
    for (auto &amp;s : vs)
      cout &lt;&lt; s &lt;&lt; '\n';
  }
</pre>
</div>

<p>
Templates are a compile-time mechanism,
so their use incurs no run-time overhead compared to hand-crafted code.
</p>

<p>
A template can take value arguments:
</p>
<div class="org-src-container">
<pre class="src src-c++">  template&lt;typename T, int N&gt;
  struct Buffer {
    using value_type = T;
    constexpr int size() { return N; }
    T[N];
    // ...
  };
</pre>
</div>

<p>
The alias <code>value_type</code> and the <code>constexpr</code> function are provided
to allow users (read-only) access to the template arguments.
</p>

<p>
Can be used to create arbitrarily sized buffers on stack:
</p>
<div class="org-src-container">
<pre class="src src-c++">  Buffer&lt;char,1024&gt; glob;
</pre>
</div>

<p>
Function object: objects that can be called like functions:
</p>
<div class="org-src-container">
<pre class="src src-c++">  template&lt;typename T&gt;
  class Less_than {
    const T val; // value to compare against
  public:
    Less_than(const T &amp;v) : val(v) {}
    bool operator()(const T &amp;x) const { return x &lt; val; } // call operator
  };

  count(vec, Less_than&lt;int&gt;{x});
</pre>
</div>

<p>
Lambda expression:
</p>
<div class="org-src-container">
<pre class="src src-c++">  count(vec, [&amp;](int a) { return a &lt; x; });
</pre>
</div>

<p>
Capture nothing is <code>[ ]</code> , capture all local names used by reference is <code>[&amp;]</code> ,
 and capture all local names used by value is <code>[=]</code> .
</p>

<p>
Had we wanted to capture only x, we could have said so: <code>[&amp;x]</code> .
Had we wanted to give the generated object a copy of x,
we could have said so: <code>[=x]</code> .
</p>

<p>
Variadic templates:
</p>
<div class="org-src-container">
<pre class="src src-c++">  void f() { } // do nothing
  template&lt;typename T, typename... Tail&gt;
  void f(T head, Tail... tail) {
    g(head);    // do something to head
    f(tail...); // try again with tail
  }
</pre>
</div>

<p>
Another example in chapter 11:
</p>
<div class="org-src-container">
<pre class="src src-c++">  template &lt;typename T, typename... Args&gt;
  unique_ptr&lt;T&gt; make_unique(Args &amp;&amp;... args) {
    return std::unique_ptr&lt;T&gt;{new T{std::forward&lt;Args&gt;(args)...}};
  }
</pre>
</div>

<p>
Aliases:
</p>
<div class="org-src-container">
<pre class="src src-c++">  // in &lt;cstddef&gt;
  using size_t = unsigned int;
</pre>
</div>

<p>
It is very common for a parameterized type to provide
an alias for types related to their template arguments.
</p>
<div class="org-src-container">
<pre class="src src-c++">  template&lt;typename T&gt;
  class Vector {
  public:
    using value_type = T;
    // ...
  };
</pre>
</div>

<p>
In fact, every standard-library container provides
<code>value_type</code> as the name of its value type.
</p>
<div class="org-src-container">
<pre class="src src-c++">  template &lt;typename C&gt;
  using Element_type = typename C::value_type;

  template &lt;typename Container&gt;
  void algo(Container &amp;c) {
    Vector&lt;Element_type&lt;Container&gt;&gt; vec;
    // ...
  }
</pre>
</div>

<p>
A function template argument needs to be explicitly mentioned
only if it cannot be deduced or if there is no default:
</p>
<div class="org-src-container">
<pre class="src src-c++">  template &lt;typename Target = string, typename Source = string&gt;
  Target to(Source arg) {
    // ...
  }
  int main() {
    auto x1 = to&lt;string, double&gt;(1.2);
    auto x2 = to&lt;string&gt;(1.2); // Source is deduced to double
    auto x3 = to&lt;&gt;(1.2);
    auto x4 = to(1.2);
  }
</pre>
</div>
</div>
</div>
