cpp.org
* Library Overview

#+CAPTION: Selected Standard Library Headers
| header          | declaration                                |
|-----------------+--------------------------------------------|
| <string>        | string, basic_string                       |
| <regex>         | regex, smatch                              |
|-----------------+--------------------------------------------|
| <fstream>       | fstream, ifstream, ofstream                |
| <iostream>      | istream, ostream, cin, cout                |
| <sstream>       | istrstream, ostrstream                     |
|-----------------+--------------------------------------------|
| <array>         | array                                      |
| <vector>        | vector                                     |
| <set>           | set, multiset                              |
| <map>           | map, multimap                              |
| <unordered_map> | unordered_map, unordered_multimap          |
|-----------------+--------------------------------------------|
| <algorithm>     | copy(), find(), sort()                     |
| <random>        | default_random_engine, normal_distribution |
| <memory>        | unique_ptr, shared_ptr, allocator          |
| <utility>       | move(), swap(), pair                       |
|-----------------+--------------------------------------------|
| <cmath>         | sqrt(), pow()                              |
| <complex>       | complex, sqrt(), pow()                     |
|-----------------+--------------------------------------------|
| <future>        | future, promise                            |
| <thread>        | thread                                     |
|-----------------+--------------------------------------------|
| <forward_list>  | forward_list                               |
| <stdexcept>     | length_error, out_of_range, runtime_error  |
| <chrono>        | duration, time_point                       |
| <ios>           | hex,dec,scientific,fixed,defaultfloat      |

* Strings and Regular Expressions

A string is mutable: ===, =+==, =[]=.

=.size()=, =.insert()=, =.erase()=, =.find()= (=string::npos=),
=.substr()=, =.replace()=, =.c_str()= (read-only).

*short-string optimization*: short string values are kept in the string object itself
and only longer strings are placed on free store.

=string= is really an alias for a general template =basic_string=
with the character type =char=:
#+BEGIN_SRC c++
using string = basic_string<char>
#+END_SRC

=wstring=, =u16string=, =u32string=.

** Regular Expressions

Pattern:
#+BEGIN_SRC c++
regex pat (R"(\w{2}\s∗\d{5}(−\d{4})?)");
#+END_SRC

=regex_match()=, =regex_search()=, =regex_replace()=, =regex_iterator=, =regex_token_iterator=.

#+BEGIN_SRC c++
  int lineno = 0;
  for (string line; getline(cin, line);) {
    ++lineno;
    smatch matches;
    if (regex_search(line, matches, pat))
      cout << lineno << ": " << matches[0] << '\n';
  }
#+END_SRC

An smatch is a vector of sub-matches of type string.
The first element, here =matches[0]=, is the complete match.

Sub-match:
#+BEGIN_SRC c++
  if (1 < matches.size() && matches[1].matched)
    cout << "\t: " << matches[1] << '\n';
#+END_SRC

Regular expressions are compiled into state machines for efficient execution.

Character classes and abbreviations (skipped here).

Iterator:
#+BEGIN_SRC c++
  string input = "aa as; asd ++eˆasdf asdfg";
  regex pat{R"(\s+(\w+))"};
  for (sregex_iterator p(input.begin(), input.end(), pat);
       p != sregex_iterator{}; ++p)
    cout << (*p)[1] << '\n';
#+END_SRC

Return strings by value (rely on move semantics).

Use a string_stream or a generic value extraction function (such as =to<X>=)
for numeric conversion of strings.

* I/O Streams

By default, =>>= skips initial whitespace.

By default, a whitespace character, such as a space or a newline, terminates the read.
You can read a whole line (including the terminating newline character) using the =getline()= function.
#+BEGIN_SRC c++
getline(cin,str);
#+END_SRC

I/O state:
#+BEGIN_SRC c++
  while (cin >> i)
    res.push_back(i);

  if (cin.eof()) {
    // ...
  } else if (cin.fail()) { // a potentially recoverable error
    cin.clear();           // reset the state to good()
    // ...
    // if fail again
    cin.setstate(ios_base::failbit); // add fail() to cin's state
  }
#+END_SRC

Custom =<<= and =>>= :
#+BEGIN_SRC c++
  ostream &operator<<(ostream &os, const Entry &e) {
    return os << "{\"" << e.name << "\", " << e.number << "}";
  }

  istream &operator>>(istream &is, Entry &e) {
    char c, c2;
    if (is >> c && c == '{' && is >> c2 && c2 == '"') { // start with a {"
      string name;                                      // read a string name
      while (is.get(c) && c != '"')                     // end with "
        name += c;
      if (is >> c && c == ',') { // seperated by ,
        int number = 0;
        if (is >> number >> c && c == '}') { // read the number and a }
          e = {name, number};
          return is;
        }
      }
    }
    // oh no
    is.setstate(ios_base::failbit);
    return is;
  }
#+END_SRC

Formatting:
#+BEGIN_SRC c++
  #include<iostream>
  #include<ios>
  using namespace std;

  int main(){
    cout << 1234 << ','
         << hex << 1234 << ','
         << oct << 1234 << '\n';
    // 1234,4d2,2322
    constexpr double d = 123.456;
    cout << d << "; "
         << scientific << d << "; "
         << fixed << d << "; "
         << defaultfloat << d << '\n';
    // 123.456; 1.234560e+02; 123.456000; 123.456
    cout.precision(2);
    cout << fixed << d << '\n';
    // 123.46
  }
#+END_SRC

=precision()= affects =defaultfloat=, =scientific=, =fixed=.

=#include <iomanip>= when using standard manipulators taking arguments.

Test files for reading and writing:
#+BEGIN_SRC c++
  ofstream ofs("target");
  if (!ofs) error("couldn't open 'target' for writing");
  ifstream ifs("source");
  if (!ifs) error("couldn't open 'source' for reading");
#+END_SRC

=<sstream>= : =istringstream=,  =ostringstream=, =stringstream=.

The result from an istringstream can be read using =str()=.

Use =stringstream= for in-memory formatting.

