cpp.html

<div id="outline-container-orgf02dc4f" class="outline-2">
<h2 id="orgf02dc4f"><span class="section-number-2">6.</span> Library Overview</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Selected Standard Library Headers</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">header</th>
<th scope="col" class="org-left">declaration</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&lt;string&gt;</td>
<td class="org-left">string, basic_string</td>
</tr>

<tr>
<td class="org-left">&lt;regex&gt;</td>
<td class="org-left">regex, smatch</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&lt;fstream&gt;</td>
<td class="org-left">fstream, ifstream, ofstream</td>
</tr>

<tr>
<td class="org-left">&lt;iostream&gt;</td>
<td class="org-left">istream, ostream, cin, cout</td>
</tr>

<tr>
<td class="org-left">&lt;sstream&gt;</td>
<td class="org-left">istrstream, ostrstream</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&lt;array&gt;</td>
<td class="org-left">array</td>
</tr>

<tr>
<td class="org-left">&lt;vector&gt;</td>
<td class="org-left">vector</td>
</tr>

<tr>
<td class="org-left">&lt;set&gt;</td>
<td class="org-left">set, multiset</td>
</tr>

<tr>
<td class="org-left">&lt;map&gt;</td>
<td class="org-left">map, multimap</td>
</tr>

<tr>
<td class="org-left">&lt;unordered_map&gt;</td>
<td class="org-left">unordered_map, unordered_multimap</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&lt;algorithm&gt;</td>
<td class="org-left">copy(), find(), sort()</td>
</tr>

<tr>
<td class="org-left">&lt;random&gt;</td>
<td class="org-left">default_random_engine, normal_distribution</td>
</tr>

<tr>
<td class="org-left">&lt;memory&gt;</td>
<td class="org-left">unique_ptr, shared_ptr, allocator</td>
</tr>

<tr>
<td class="org-left">&lt;utility&gt;</td>
<td class="org-left">move(), swap(), pair</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&lt;cmath&gt;</td>
<td class="org-left">sqrt(), pow()</td>
</tr>

<tr>
<td class="org-left">&lt;complex&gt;</td>
<td class="org-left">complex, sqrt(), pow()</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&lt;future&gt;</td>
<td class="org-left">future, promise</td>
</tr>

<tr>
<td class="org-left">&lt;thread&gt;</td>
<td class="org-left">thread</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&lt;forward_list&gt;</td>
<td class="org-left">forward_list</td>
</tr>

<tr>
<td class="org-left">&lt;stdexcept&gt;</td>
<td class="org-left">length_error, out_of_range, runtime_error</td>
</tr>

<tr>
<td class="org-left">&lt;chrono&gt;</td>
<td class="org-left">duration, time_point</td>
</tr>

<tr>
<td class="org-left">&lt;ios&gt;</td>
<td class="org-left">hex,dec,scientific,fixed,defaultfloat</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc8c873e" class="outline-2">
<h2 id="orgc8c873e"><span class="section-number-2">7.</span> Strings and Regular Expressions</h2>
<div class="outline-text-2" id="text-7">
<p>
A string is mutable: <code>=</code>, <code>+=</code>, <code>[]</code>.
</p>

<p>
<code>.size()</code>, <code>.insert()</code>, <code>.erase()</code>, <code>.find()</code> (<code>string::npos</code>),
<code>.substr()</code>, <code>.replace()</code>, <code>.c_str()</code> (read-only).
</p>

<p>
<b>short-string optimization</b>: short string values are kept in the string object itself
and only longer strings are placed on free store.
</p>

<p>
<code>string</code> is really an alias for a general template <code>basic_string</code>
with the character type <code>char</code>:
</p>
<div class="org-src-container">
<pre class="src src-c++">using string = basic_string&lt;char&gt;
</pre>
</div>

<p>
<code>wstring</code>, <code>u16string</code>, <code>u32string</code>.
</p>
</div>

<div id="outline-container-org0649632" class="outline-3">
<h3 id="org0649632"><span class="section-number-3">7.1.</span> Regular Expressions</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Pattern:
</p>
<div class="org-src-container">
<pre class="src src-c++">regex pat (R"(\w{2}\s∗\d{5}(−\d{4})?)");
</pre>
</div>

<p>
<code>regex_match()</code>, <code>regex_search()</code>, <code>regex_replace()</code>, <code>regex_iterator</code>, <code>regex_token_iterator</code>.
</p>

<div class="org-src-container">
<pre class="src src-c++">  int lineno = 0;
  for (string line; getline(cin, line);) {
    ++lineno;
    smatch matches;
    if (regex_search(line, matches, pat))
      cout &lt;&lt; lineno &lt;&lt; ": " &lt;&lt; matches[0] &lt;&lt; '\n';
  }
</pre>
</div>

<p>
An smatch is a vector of sub-matches of type string.
The first element, here <code>matches[0]</code>, is the complete match.
</p>

<p>
Sub-match:
</p>
<div class="org-src-container">
<pre class="src src-c++">  if (1 &lt; matches.size() &amp;&amp; matches[1].matched)
    cout &lt;&lt; "\t: " &lt;&lt; matches[1] &lt;&lt; '\n';
</pre>
</div>

<p>
Regular expressions are compiled into state machines for efficient execution.
</p>

<p>
Character classes and abbreviations (skipped here).
</p>

<p>
Iterator:
</p>
<div class="org-src-container">
<pre class="src src-c++">  string input = "aa as; asd ++eˆasdf asdfg";
  regex pat{R"(\s+(\w+))"};
  for (sregex_iterator p(input.begin(), input.end(), pat);
       p != sregex_iterator{}; ++p)
    cout &lt;&lt; (*p)[1] &lt;&lt; '\n';
</pre>
</div>

<p>
Return strings by value (rely on move semantics).
</p>

<p>
Use a string_stream or a generic value extraction function (such as <code>to&lt;X&gt;</code>)
for numeric conversion of strings.
</p>
</div>
</div>
</div>

<div id="outline-container-org219a6d5" class="outline-2">
<h2 id="org219a6d5"><span class="section-number-2">8.</span> I/O Streams</h2>
<div class="outline-text-2" id="text-8">
<p>
By default, <code>&gt;&gt;</code> skips initial whitespace.
</p>

<p>
By default, a whitespace character, such as a space or a newline, terminates the read.
You can read a whole line (including the terminating newline character) using the <code>getline()</code> function.
</p>
<div class="org-src-container">
<pre class="src src-c++">getline(cin,str);
</pre>
</div>

<p>
I/O state:
</p>
<div class="org-src-container">
<pre class="src src-c++">  while (cin &gt;&gt; i)
    res.push_back(i);

  if (cin.eof()) {
    // ...
  } else if (cin.fail()) { // a potentially recoverable error
    cin.clear();           // reset the state to good()
    // ...
    // if fail again
    cin.setstate(ios_base::failbit); // add fail() to cin's state
  }
</pre>
</div>

<p>
Custom <code>&lt;&lt;</code> and <code>&gt;&gt;</code> :
</p>
<div class="org-src-container">
<pre class="src src-c++">  ostream &amp;operator&lt;&lt;(ostream &amp;os, const Entry &amp;e) {
    return os &lt;&lt; "{\"" &lt;&lt; e.name &lt;&lt; "\", " &lt;&lt; e.number &lt;&lt; "}";
  }

  istream &amp;operator&gt;&gt;(istream &amp;is, Entry &amp;e) {
    char c, c2;
    if (is &gt;&gt; c &amp;&amp; c == '{' &amp;&amp; is &gt;&gt; c2 &amp;&amp; c2 == '"') { // start with a {"
      string name;                                      // read a string name
      while (is.get(c) &amp;&amp; c != '"')                     // end with "
        name += c;
      if (is &gt;&gt; c &amp;&amp; c == ',') { // seperated by ,
        int number = 0;
        if (is &gt;&gt; number &gt;&gt; c &amp;&amp; c == '}') { // read the number and a }
          e = {name, number};
          return is;
        }
      }
    }
    // oh no
    is.setstate(ios_base::failbit);
    return is;
  }
</pre>
</div>

<p>
Formatting:
</p>
<div class="org-src-container">
<pre class="src src-c++">  #include&lt;iostream&gt;
  #include&lt;ios&gt;
  using namespace std;

  int main(){
    cout &lt;&lt; 1234 &lt;&lt; ','
         &lt;&lt; hex &lt;&lt; 1234 &lt;&lt; ','
         &lt;&lt; oct &lt;&lt; 1234 &lt;&lt; '\n';
    // 1234,4d2,2322
    constexpr double d = 123.456;
    cout &lt;&lt; d &lt;&lt; "; "
         &lt;&lt; scientific &lt;&lt; d &lt;&lt; "; "
         &lt;&lt; fixed &lt;&lt; d &lt;&lt; "; "
         &lt;&lt; defaultfloat &lt;&lt; d &lt;&lt; '\n';
    // 123.456; 1.234560e+02; 123.456000; 123.456
    cout.precision(2);
    cout &lt;&lt; fixed &lt;&lt; d &lt;&lt; '\n';
    // 123.46
  }
</pre>
</div>

<p>
<code>precision()</code> affects <code>defaultfloat</code>, <code>scientific</code>, <code>fixed</code>.
</p>

<p>
<code>#include &lt;iomanip&gt;</code> when using standard manipulators taking arguments.
</p>

<p>
Test files for reading and writing:
</p>
<div class="org-src-container">
<pre class="src src-c++">  ofstream ofs("target");
  if (!ofs) error("couldn't open 'target' for writing");
  ifstream ifs("source");
  if (!ifs) error("couldn't open 'source' for reading");
</pre>
</div>

<p>
<code>&lt;sstream&gt;</code> : <code>istringstream</code>,  <code>ostringstream</code>, <code>stringstream</code>.
</p>

<p>
The result from an istringstream can be read using <code>str()</code>.
</p>

<p>
Use <code>stringstream</code> for in-memory formatting.
</p>
</div>
</div>
