cpp.org
* Containers

typical implementation of vector:
+ elem : a handle holding pointers to the first element
+ space : one-past-the-last element
+ last : one-past-the-last allocated space
+ alloc : allocator from which can acquire memory for elements

Initilize:
#+BEGIN_SRC c++
  vector<int> v1 = {1, 2, 3, 4}; // size is 4
  vector<string> v2;             // size is 0
  vector<Shape*> v3(23);         // size is 23; initial element value: nullptr
  vector<double> v4(32, 9.9);    // size is 32; initial element value: 9.9
#+END_SRC

A vector can be copied in assignments and initializations:
#+BEGIN_SRC c++
  vector<Entry> book2 = phone_book;
#+END_SRC

When you insert a new element, its value is copied into the container.

The =at()= operation throws an exception of type =out_of_range=
if its argument is out of the vector's range.

=list= : doubly-linked list.

=map= : a search tree (a red-black tree).

If a key isn’t found with =[]=, it is inserted into the =map= with a default value for its value.

=nordered_map=.
The standard-library provides a default hash function for strings
as well as for other built-in and standard-library types.
If necessary, you can provide your own.

A hash function is often provided as a function object:
#+BEGIN_SRC c++
  struct Record {
    string name;
    int product_code;
    // ...
  };
  // a hash function for Record
  struct Rhash {
    size_t operator()(const Record &r) const {
      return hash<string>()(r.name) ^ hash<int>()(r.product_code);
    }
  };
  // set of Recoreds using Rhash for lookup
  unordered_set<Record, Rhash> my_set;
#+END_SRC

Creaing a new hash function by combining existing hash functions
using exclusive or (^) is simple and often very effective.

+ vector<T>, list<T>, forward_list<T>
+ map<K,V>, multimap<K,V>, unordered_map<K,V>, unordered_multimap<K,V>
+ set<T>, multiset<T>, unordered_set<T> unordered_multiset<T>
+ deque<T>, queue<T>, stack<T>, priority_queue<T>
+ fixed-size array =array<T,N>=, bitset<N>
 
Please note that a vector is usually more efficient than a list
for short sequences of small elements (even for insert() and erase()).

Use =forward_list= for sequences that are usually empty.

When it comes to performance, don’t trust your intuition: measure.

Pass a container by reference and return a container by value.

* Algorithms

#+BEGIN_SRC c++
  sort(vec.begin(), vec.end());
  unique_copy(vec.begin(), vec.end(), lst.begin());
  unique_copy(vec.begin(), vec.end(), back_inserter(lst));
#+END_SRC

 #+BEGIN_SRC c++
   if (find(s.begin(), s.end(), c) != s.end())
     /* ... */;
 #+END_SRC

each container knows its iterator types and makes them available
under the conventional names =iterator= and =const_iterator=.

#+BEGIN_SRC c++
  template <typename C, typename V>
  vector<typename C::iterator> find_all(C &c, V v) {
#+END_SRC

The typename is needed to inform the compiler that
C's iterator is supposed to be a type and not a value of some type.

With aliases:
#+BEGIN_SRC c++
template<typename T>
using Iterator = typename T::iterator;

template<typename C, typename V>
vector<Iterator<C>> find_all(C& c, V v) {
#+END_SRC

Stream iterator:
#+BEGIN_SRC c++
  int main() {
    ostream_iterator<string> oo{cout}; // write strings to cout
    ,*oo = "Hello, ";  // meaning cout<<"Hello, "
    ++oo;
    ,*oo = "world!\n"; // meaning cout<<"world!\n"
    istream_iterator<string> ii{cin};
    istream_iterator<string> eos{}; // indicate the end of input
  }
#+END_SRC

Manipulate files:
#+BEGIN_SRC c++
  int unique_copy(string from, string to) {
    ifstream is{from};
    ofstream os{to};
    set<string> b{istream_iterator<string>{is}, istream_iterator<string>{}};
    copy(b.begin(), b.end(), ostream_iterator<string>{os, "\n"});
    return !is.eof() || !os;
  }
#+END_SRC

Predictors:
#+BEGIN_SRC c++
  struct Greater_than {
    int val;
    Greater_than(int v) : val{v} {}
    bool operator()(const pair<string, int> &r) { return r.second > val; }
  };
  // use as
  auto p = find_if(m.begin(), m.end(), Greater_than{42});
  // or lambda
  auto p = find_if(m.begin(), m.end(), [](const pair<string,int>& r) { return r.second>42; });
#+END_SRC

A predicate must not modify its argument.

Functions in =<algorithm>=:
#+BEGIN_SRC c++
  p = find(b, e, x);
  p = find_if(b, e, f);
  n = count(b, e, x);
  n = count_if(b, e, f);
  replace(b, e, v, v2);
  replace_if(b, e, f, v2);
  p = copy(b, e, out); // from [b:e) to [out:p)
  p = copy_if(b, e, out, f);
  p = move(b, e, out);
  p = unique_copy(b, e, out);
  sort(b, e);
  sort(b, e, f);                   // Sort elements of [b:e) using f
  (p1, p2) = equal_range(b, e, v); // [p1:p2) is the subsequence with the value v
  p = merge(b, e, b2, e2, out);
#+END_SRC

Some algorithms, such as =replace()= and =sort()=, modify element values,
But *no algorithm add or subtract elements* of a container.

If you want to add elements, you need something,
such as an =back_inserter= that knows about the container.

* Utilities
** Smart Pointers
In =<memory>=, the stan- dard library provides two 
smart pointers to help manage objects on the free store:
1. =unique_ptr= to represent unique ownership
2. =shared_ptr= to represent shared ownership

The =shared_ptr= is similar to =unique_ptr= except that
shared_ptrs are *copied rather than moved*.

The shared_ptrs for an object share ownership of an object and
that object is destroyed when the last of its shared_ptrs is destroyed.

the standard library (in =<memory>=) provides a function =make_shared()=:
#+BEGIN_SRC c++
  shared_ptr<S> p1{new S{1, "Ankh Morpork", 4.65}};
  auto p2 = make_shared<S>(2, "Oz", 7.62);
#+END_SRC

Use =unique_ptr= to refer to objects of polymorphic type.
Use =shared_ptr= to refer to shared objects.

