cpp.html

<div id="outline-container-orgee115ba" class="outline-2">
<h2 id="orgee115ba"><span class="section-number-2">9.</span> Containers</h2>
<div class="outline-text-2" id="text-9">
<p>
typical implementation of vector:
</p>
<ul class="org-ul">
<li>elem : a handle holding pointers to the first element</li>
<li>space : one-past-the-last element</li>
<li>last : one-past-the-last allocated space</li>
<li>alloc : allocator from which can acquire memory for elements</li>
</ul>

<p>
Initilize:
</p>
<div class="org-src-container">
<pre class="src src-c++">  vector&lt;int&gt; v1 = {1, 2, 3, 4}; // size is 4
  vector&lt;string&gt; v2;             // size is 0
  vector&lt;Shape*&gt; v3(23);         // size is 23; initial element value: nullptr
  vector&lt;double&gt; v4(32, 9.9);    // size is 32; initial element value: 9.9
</pre>
</div>

<p>
A vector can be copied in assignments and initializations:
</p>
<div class="org-src-container">
<pre class="src src-c++">  vector&lt;Entry&gt; book2 = phone_book;
</pre>
</div>

<p>
When you insert a new element, its value is copied into the container.
</p>

<p>
The <code>at()</code> operation throws an exception of type <code>out_of_range</code>
if its argument is out of the vector's range.
</p>

<p>
<code>list</code> : doubly-linked list.
</p>

<p>
<code>map</code> : a search tree (a red-black tree).
</p>

<p>
If a key isn’t found with <code>[]</code>, it is inserted into the <code>map</code> with a default value for its value.
</p>

<p>
<code>nordered_map</code>.
The standard-library provides a default hash function for strings
as well as for other built-in and standard-library types.
If necessary, you can provide your own.
</p>

<p>
A hash function is often provided as a function object:
</p>
<div class="org-src-container">
<pre class="src src-c++">  struct Record {
    string name;
    int product_code;
    // ...
  };
  // a hash function for Record
  struct Rhash {
    size_t operator()(const Record &amp;r) const {
      return hash&lt;string&gt;()(r.name) ^ hash&lt;int&gt;()(r.product_code);
    }
  };
  // set of Recoreds using Rhash for lookup
  unordered_set&lt;Record, Rhash&gt; my_set;
</pre>
</div>

<p>
Creaing a new hash function by combining existing hash functions
using exclusive or (^) is simple and often very effective.
</p>

<ul class="org-ul">
<li>vector&lt;T&gt;, list&lt;T&gt;, forward_list&lt;T&gt;</li>
<li>map&lt;K,V&gt;, multimap&lt;K,V&gt;, unordered_map&lt;K,V&gt;, unordered_multimap&lt;K,V&gt;</li>
<li>set&lt;T&gt;, multiset&lt;T&gt;, unordered_set&lt;T&gt; unordered_multiset&lt;T&gt;</li>
<li>deque&lt;T&gt;, queue&lt;T&gt;, stack&lt;T&gt;, priority_queue&lt;T&gt;</li>
<li>fixed-size array <code>array&lt;T,N&gt;</code>, bitset&lt;N&gt;</li>
</ul>

<p>
Please note that a vector is usually more efficient than a list
for short sequences of small elements (even for insert() and erase()).
</p>

<p>
Use <code>forward_list</code> for sequences that are usually empty.
</p>

<p>
When it comes to performance, don’t trust your intuition: measure.
</p>

<p>
Pass a container by reference and return a container by value.
</p>
</div>
</div>

<div id="outline-container-org7f6a9d2" class="outline-2">
<h2 id="org7f6a9d2"><span class="section-number-2">10.</span> Algorithms</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-c++">  sort(vec.begin(), vec.end());
  unique_copy(vec.begin(), vec.end(), lst.begin());
  unique_copy(vec.begin(), vec.end(), back_inserter(lst));
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c++">   if (find(s.begin(), s.end(), c) != s.end())
     /* ... */;
</pre>
</div>

<p>
each container knows its iterator types and makes them available
under the conventional names <code>iterator</code> and <code>const_iterator</code>.
</p>

<div class="org-src-container">
<pre class="src src-c++">  template &lt;typename C, typename V&gt;
  vector&lt;typename C::iterator&gt; find_all(C &amp;c, V v) {
</pre>
</div>

<p>
The typename is needed to inform the compiler that
C's iterator is supposed to be a type and not a value of some type.
</p>

<p>
With aliases:
</p>
<div class="org-src-container">
<pre class="src src-c++">template&lt;typename T&gt;
using Iterator = typename T::iterator;

template&lt;typename C, typename V&gt;
vector&lt;Iterator&lt;C&gt;&gt; find_all(C&amp; c, V v) {
</pre>
</div>

<p>
Stream iterator:
</p>
<div class="org-src-container">
<pre class="src src-c++">  int main() {
    ostream_iterator&lt;string&gt; oo{cout}; // write strings to cout
    *oo = "Hello, ";  // meaning cout&lt;&lt;"Hello, "
    ++oo;
    *oo = "world!\n"; // meaning cout&lt;&lt;"world!\n"
    istream_iterator&lt;string&gt; ii{cin};
    istream_iterator&lt;string&gt; eos{}; // indicate the end of input
  }
</pre>
</div>

<p>
Manipulate files:
</p>
<div class="org-src-container">
<pre class="src src-c++">  int unique_copy(string from, string to) {
    ifstream is{from};
    ofstream os{to};
    set&lt;string&gt; b{istream_iterator&lt;string&gt;{is}, istream_iterator&lt;string&gt;{}};
    copy(b.begin(), b.end(), ostream_iterator&lt;string&gt;{os, "\n"});
    return !is.eof() || !os;
  }
</pre>
</div>

<p>
Predictors:
</p>
<div class="org-src-container">
<pre class="src src-c++">  struct Greater_than {
    int val;
    Greater_than(int v) : val{v} {}
    bool operator()(const pair&lt;string, int&gt; &amp;r) { return r.second &gt; val; }
  };
  // use as
  auto p = find_if(m.begin(), m.end(), Greater_than{42});
  // or lambda
  auto p = find_if(m.begin(), m.end(), [](const pair&lt;string,int&gt;&amp; r) { return r.second&gt;42; });
</pre>
</div>

<p>
A predicate must not modify its argument.
</p>

<p>
Functions in <code>&lt;algorithm&gt;</code>:
</p>
<div class="org-src-container">
<pre class="src src-c++">  p = find(b, e, x);
  p = find_if(b, e, f);
  n = count(b, e, x);
  n = count_if(b, e, f);
  replace(b, e, v, v2);
  replace_if(b, e, f, v2);
  p = copy(b, e, out); // from [b:e) to [out:p)
  p = copy_if(b, e, out, f);
  p = move(b, e, out);
  p = unique_copy(b, e, out);
  sort(b, e);
  sort(b, e, f);                   // Sort elements of [b:e) using f
  (p1, p2) = equal_range(b, e, v); // [p1:p2) is the subsequence with the value v
  p = merge(b, e, b2, e2, out);
</pre>
</div>

<p>
Some algorithms, such as <code>replace()</code> and <code>sort()</code>, modify element values,
But <b>no algorithm add or subtract elements</b> of a container.
</p>

<p>
If you want to add elements, you need something,
such as an <code>back_inserter</code> that knows about the container.
</p>
</div>
</div>

<div id="outline-container-org451364d" class="outline-2">
<h2 id="org451364d"><span class="section-number-2">11.</span> Utilities</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org5db590c" class="outline-3">
<h3 id="org5db590c"><span class="section-number-3">11.1.</span> Smart Pointers</h3>
<div class="outline-text-3" id="text-11-1">
<p>
In <code>&lt;memory&gt;</code>, the stan- dard library provides two 
smart pointers to help manage objects on the free store:
</p>
<ol class="org-ol">
<li><code>unique_ptr</code> to represent unique ownership</li>
<li><code>shared_ptr</code> to represent shared ownership</li>
</ol>

<p>
The <code>shared_ptr</code> is similar to <code>unique_ptr</code> except that
shared_ptrs are <b>copied rather than moved</b>.
</p>

<p>
The shared_ptrs for an object share ownership of an object and
that object is destroyed when the last of its shared_ptrs is destroyed.
</p>

<p>
the standard library (in <code>&lt;memory&gt;</code>) provides a function <code>make_shared()</code>:
</p>
<div class="org-src-container">
<pre class="src src-c++">  shared_ptr&lt;S&gt; p1{new S{1, "Ankh Morpork", 4.65}};
  auto p2 = make_shared&lt;S&gt;(2, "Oz", 7.62);
</pre>
</div>

<p>
Use <code>unique_ptr</code> to refer to objects of polymorphic type.
Use <code>shared_ptr</code> to refer to shared objects.
</p>
</div>
</div>
