cpp.org
** Specialized Containers


#+CAPTION: Almost Conainers
| Container       | Description                                                         |
|-----------------+---------------------------------------------------------------------|
| T[N]            | Built-in array                                                      |
| array<T,N>      | Like the built-in array, but *with most problems solved*            |
| bitset<N>       |                                                                     |
| vector<bool>    | A sequence of bits *compactly* stored in a specialization of vector |
| pair<T,U>       |                                                                     |
| tuple<T...>     |                                                                     |
| basic_string<C> |                                                                     |
| valarray<T>     | An array of numeric values of type T; provides numeric operations   |

*** array
An array, defined in =<array>=, is a fixed-size sequence of elements of a given type
where *the number of elements is specified at compile time*.

Thus, an array can be allocated with its elements on the stack,
in an object, or in static storage.

There is no overhead (time or space) involved in using an array
compared to using a built-in array.

An array knows its size, can be copied (using = or initialization),
and saves one from surprising nasty conversions to pointers.

An array does not "handle to elements."

The element count is not optional:
#+BEGIN_SRC c++
  array<int> ax = {1, 2, 3};
#+END_SRC

an array can be explicitly passed to a C-style function that expects a pointer:
#+BEGIN_SRC c++
  void f(int∗ p, int sz); // C-style interface
  void g() {
    array<int, 10> a;
    f(a, a.size());                         // error: no conversion
    f(&a[0], a.size());                     // C-style use
    f(a.data(), a.size());                  // C-style use
    auto p = find(a.begin(), a.end(), 777); // C++/STL-style use
  }
#+END_SRC

*** bitset
A =bitset= can be initialized with an integer or a string:
#+BEGIN_SRC c++
  bitset<9> bs1{"110001111"};
  bitset<9> bs2{399};
  bitset<9> bs3 =  ̃bs1;
  bitset<9> bs4 = bs1 & bs3;
  bitset<9> bs5 = bs1 << 2;
#+END_SRC

=to_ullong()= and =to_string()= provide the inverse operations to the constructors.

*** pair and tuple

The make_pair() / make_tuple() function makes it easy to create
a pair / tuple without explicitly mentioning its type.

Elements of tuple can be accessed by =get<0>(t), get<1>(t), get<2>(t)=.

*** Time
The standard-library facilities for dealing with time
are found in the subnamespace =std::chrono= in =<chrono>=.

Timing something:
#+BEGIN_SRC c++
  using namespace std::chrono;
  auto t0 = high_resolution_clock::now();
  do_work();
  auto t1 = high_resolution_clock::now();
  cout << duration_cast<milliseconds>(t1−t0).count() << "msec\n";
#+END_SRC

*** Function
A function adaptor takes a function as argument and returns a function object
that can be used to invoke the original function.

The standard library provides =bind()= and =mem_fn()= adaptors to do argument binding,
also called /Currying/ or /partial evaluation/.

#+BEGIN_SRC c++
  #include<functional>
  void f(int, const string &);
  auto g = bind(f, 2, placeholders::_1); // bind f()’s first argument to 2
  f(2, "hello");
  g("hello");
#+END_SRC

Use =mem_fn()= to create function objects that can invoke a member function
when called using the traditional function call notation.
#+BEGIN_SRC c++
  p−> draw();
  auto draw = mem_fn(&Shape::draw);
  draw(p);

  for_each(v.begin(), v.end(), mem_fn(&Shape::draw));
#+END_SRC

Often, a lambda is an alternative to using =bind()= or =mem_fn()=.

A =function= is specified with a specific return type and a specific argument type:
#+BEGIN_SRC c++
  int f1(double);
  function<int(double)> fct{f1}; // initialize to f1

  void user() {
    fct = [](double d) { return round(d); }; // assign lambda to fct
    fct = f1;                                // assign function to fct
  }
#+END_SRC

Use function when you need to store something that can be called.

A type function is a function that is evaluated at compile-time
given a type as its argument or returning a type.
#+BEGIN_SRC c++
  #include <limits>
  constexpr float min = numeric_limits<float>::min(); // smallest positive float
#+END_SRC

Metaprogramming or (when templates are involved) template metaprogramming.

=iterator_trait=, tag dispatch, type predicates.

=<type_traits>= : is_arithmetic, is_class, is_pod, is_literal_type,
has_virtual_destructor, and is_base_of.

