cpp.html

<div id="outline-container-org1e09671" class="outline-3">
<h3 id="org1e09671"><span class="section-number-3">11.2.</span> Specialized Containers</h3>
<div class="outline-text-3" id="text-11-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> Almost Conainers</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Container</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">T[N]</td>
<td class="org-left">Built-in array</td>
</tr>

<tr>
<td class="org-left">array&lt;T,N&gt;</td>
<td class="org-left">Like the built-in array, but <b>with most problems solved</b></td>
</tr>

<tr>
<td class="org-left">bitset&lt;N&gt;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">vector&lt;bool&gt;</td>
<td class="org-left">A sequence of bits <b>compactly</b> stored in a specialization of vector</td>
</tr>

<tr>
<td class="org-left">pair&lt;T,U&gt;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">tuple&lt;T&#x2026;&gt;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">basic_string&lt;C&gt;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">valarray&lt;T&gt;</td>
<td class="org-left">An array of numeric values of type T; provides numeric operations</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgd80b02f" class="outline-4">
<h4 id="orgd80b02f"><span class="section-number-4">11.2.1.</span> array</h4>
<div class="outline-text-4" id="text-11-2-1">
<p>
An array, defined in <code>&lt;array&gt;</code>, is a fixed-size sequence of elements of a given type
where <b>the number of elements is specified at compile time</b>.
</p>

<p>
Thus, an array can be allocated with its elements on the stack,
in an object, or in static storage.
</p>

<p>
There is no overhead (time or space) involved in using an array
compared to using a built-in array.
</p>

<p>
An array knows its size, can be copied (using = or initialization),
and saves one from surprising nasty conversions to pointers.
</p>

<p>
An array does not "handle to elements."
</p>

<p>
The element count is not optional:
</p>
<div class="org-src-container">
<pre class="src src-c++">  array&lt;int&gt; ax = {1, 2, 3};
</pre>
</div>

<p>
an array can be explicitly passed to a C-style function that expects a pointer:
</p>
<div class="org-src-container">
<pre class="src src-c++">  void f(int∗ p, int sz); // C-style interface
  void g() {
    array&lt;int, 10&gt; a;
    f(a, a.size());                         // error: no conversion
    f(&amp;a[0], a.size());                     // C-style use
    f(a.data(), a.size());                  // C-style use
    auto p = find(a.begin(), a.end(), 777); // C++/STL-style use
  }
</pre>
</div>
</div>
</div>

<div id="outline-container-org70f35d5" class="outline-4">
<h4 id="org70f35d5"><span class="section-number-4">11.2.2.</span> bitset</h4>
<div class="outline-text-4" id="text-11-2-2">
<p>
A <code>bitset</code> can be initialized with an integer or a string:
</p>
<div class="org-src-container">
<pre class="src src-c++">  bitset&lt;9&gt; bs1{"110001111"};
  bitset&lt;9&gt; bs2{399};
  bitset&lt;9&gt; bs3 =  ̃bs1;
  bitset&lt;9&gt; bs4 = bs1 &amp; bs3;
  bitset&lt;9&gt; bs5 = bs1 &lt;&lt; 2;
</pre>
</div>

<p>
<code>to_ullong()</code> and <code>to_string()</code> provide the inverse operations to the constructors.
</p>
</div>
</div>

<div id="outline-container-org9239e64" class="outline-4">
<h4 id="org9239e64"><span class="section-number-4">11.2.3.</span> pair and tuple</h4>
<div class="outline-text-4" id="text-11-2-3">
<p>
The make_pair() / make_tuple() function makes it easy to create
a pair / tuple without explicitly mentioning its type.
</p>

<p>
Elements of tuple can be accessed by <code>get&lt;0&gt;(t), get&lt;1&gt;(t), get&lt;2&gt;(t)</code>.
</p>
</div>
</div>

<div id="outline-container-org8025e1e" class="outline-4">
<h4 id="org8025e1e"><span class="section-number-4">11.2.4.</span> Time</h4>
<div class="outline-text-4" id="text-11-2-4">
<p>
The standard-library facilities for dealing with time
are found in the subnamespace <code>std::chrono</code> in <code>&lt;chrono&gt;</code>.
</p>

<p>
Timing something:
</p>
<div class="org-src-container">
<pre class="src src-c++">  using namespace std::chrono;
  auto t0 = high_resolution_clock::now();
  do_work();
  auto t1 = high_resolution_clock::now();
  cout &lt;&lt; duration_cast&lt;milliseconds&gt;(t1−t0).count() &lt;&lt; "msec\n";
</pre>
</div>
</div>
</div>

<div id="outline-container-org75c9107" class="outline-4">
<h4 id="org75c9107"><span class="section-number-4">11.2.5.</span> Function</h4>
<div class="outline-text-4" id="text-11-2-5">
<p>
A function adaptor takes a function as argument and returns a function object
that can be used to invoke the original function.
</p>

<p>
The standard library provides <code>bind()</code> and <code>mem_fn()</code> adaptors to do argument binding,
also called <i>Currying</i> or <i>partial evaluation</i>.
</p>

<div class="org-src-container">
<pre class="src src-c++">  #include&lt;functional&gt;
  void f(int, const string &amp;);
  auto g = bind(f, 2, placeholders::_1); // bind f()’s first argument to 2
  f(2, "hello");
  g("hello");
</pre>
</div>

<p>
Use <code>mem_fn()</code> to create function objects that can invoke a member function
when called using the traditional function call notation.
</p>
<div class="org-src-container">
<pre class="src src-c++">  p−&gt; draw();
  auto draw = mem_fn(&amp;Shape::draw);
  draw(p);

  for_each(v.begin(), v.end(), mem_fn(&amp;Shape::draw));
</pre>
</div>

<p>
Often, a lambda is an alternative to using <code>bind()</code> or <code>mem_fn()</code>.
</p>

<p>
A <code>function</code> is specified with a specific return type and a specific argument type:
</p>
<div class="org-src-container">
<pre class="src src-c++">  int f1(double);
  function&lt;int(double)&gt; fct{f1}; // initialize to f1

  void user() {
    fct = [](double d) { return round(d); }; // assign lambda to fct
    fct = f1;                                // assign function to fct
  }
</pre>
</div>

<p>
Use function when you need to store something that can be called.
</p>

<p>
A type function is a function that is evaluated at compile-time
given a type as its argument or returning a type.
</p>
<div class="org-src-container">
<pre class="src src-c++">  #include &lt;limits&gt;
  constexpr float min = numeric_limits&lt;float&gt;::min(); // smallest positive float
</pre>
</div>

<p>
Metaprogramming or (when templates are involved) template metaprogramming.
</p>

<p>
<code>iterator_trait</code>, tag dispatch, type predicates.
</p>

<p>
<code>&lt;type_traits&gt;</code> : is_arithmetic, is_class, is_pod, is_literal_type,
has_virtual_destructor, and is_base_of.
</p>
</div>
</div>
</div>
</div>
