cpp.org
* Numerics
=<math>= for float, double, long double :
abs(x), ceil(x), floor(x), sqrt(x), cos(x), sin(x),
tan(x), acos(x), asin(x), sinh(x), cosh(x), tanh(x),
exp(x), log(x).

The versions for =complex= are found in =<complex>=.

Errors are reported by setting errno from =<cerrno>= to =EDOM=
for a domain error and to =ERANGE= for a range error:
#+BEGIN_SRC c++
  errno = 0; // clear old error state
  // ...
  if (errno == EDOM) cerr << "domain error";
  if (errno == ERANGE) cerr << "range error";
#+END_SRC


#+CAPTION: Numerical Algorithms in =<numeric>=
| Function                         | Description                                                  |
|----------------------------------+--------------------------------------------------------------|
| x=accumulate(b,e,i)              |                                                              |
| x=accumulate(b,e,i,f)            | using f instead of +                                         |
| x=inner_product(b,e,b2,i)        | inner product of [b:e) and [b2:b2+(e−b)), i is initial value |
| x=inner_product(b,e,b2,i,f,f2)   | using f and f2 instead of + and *                            |
| p=partial_sum(b,e,out)           |                                                              |
| p=partial_sum(b,e,out,f)         |                                                              |
| p=adjacent_difference(b,e,out)   |                                                              |
| p=adjacent_difference(b,e,out,f) |                                                              |
| iota(b,e,v)                      | For each element in [b:e) assign ++v: v+1, v+2, ...          |

A random number generator consists of two parts:
1. an *engine* that produces a sequence of random or pseudo-random values.
2. a *distribution* that maps those values into a mathematical distribution in a range.

#+BEGIN_SRC c++
  auto die = bind(uniform_int_distribution<>{1, 6},
                  default_random_engine{});
  int x = die();
#+END_SRC

=valarray= in =<valarray>=  is less general and
more amenable to *optimization for numerical computation*.

Properties of numeric types are accessible through numeric_limits.
Use numeric_limits to check that the numeric types are adequate for their use.

* Concurrency

threads, mutexes, lock() operations, packaged_tasks, and futures.

*task* s a computation that can potentially be executed concurrently with other computations.
A *thread* is the system-level representation of a task in a program.

A task is a function or a function object and launched as argument
by constructing a =std::thread= (found in =<thread>=).

#+BEGIN_SRC c++
  void f();  // function
  struct F { // function object
    void operator()();
  };
  void user() {
    thread t1{f};
    thread t2{F()};
    t1.join(); // wait for t1
    t2.join(); // wait for t2
  }
#+END_SRC

To =join= a thread means to wait for the thread to terminate.

Threads of a program *share a single address space*.
In this, threads differ from processes, which generally do not directly share data.
Since threads share an address space, they can communicate through shared objects.

The =ref()= is a type function from =<functional>= that unfortunately is needed
to tell the variadic template to treat some_vec as a reference,
rather than as an object.
#+BEGIN_SRC c++
  void f(vector<double> &v);
  thread t1{f, ref(some_vec)};
#+END_SRC

pass the input data by const reference and to
pass the location of a place to deposit the result as a separate argument:
#+BEGIN_SRC c++
  void f(const vector<double> &v, double *res);
  thread t1{f, cref(some_vec), &res1};
#+END_SRC
=cref= is for =const=.

A =mutex= in =<mutex>= is a mutual exclusion object.
A thread acquires a mutex using a =lock()= operation:
#+BEGIN_SRC c++
  mutex m;
  int sh;
  void f() {
    unique_lock<mutex> lck{m};
    sh += 7;
  } // release mutex implicitly
#+END_SRC
The =unique_lock= releases the mutex with a call =m.unlock()=.

Acquiring several locks simultaneously to avoid deadlock:
#+BEGIN_SRC c++
  unique_lock<mutex> lck1 {m1,defer_lock};
  unique_lock<mutex> lck2 {m2,defer_lock};
  unique_lock<mutex> lck3 {m3,defer_lock};
  // ...
  lock(lck1,lck2,lck3);
#+END_SRC

Sleep:
#+BEGIN_SRC c++
  using namespace std::chrono;
  this_thread::sleep_for(milliseconds{20});
#+END_SRC

The basic support for communicating using external events
is provided by condition_variables found in =<condition_variable>=.
A =condition_variable= is a mechanism allowing one thread to wait for another:
#+BEGIN_SRC c++
  queue<Message> mqueue;
  condition_variable mcond;
  mutex mmutex;

  void consumer() {
    while (true) {
      unique_lock<mutex> lck{mmutex};
      while (mcond.wait(lck))
        /* do nothing */;
      auto m = mqueue.front();
      mqueue.pop();
      lck.unlock();
      // process m...
    }
  }
  void producer() {
    while (true) {
      Message m;
      // ... fill the message ...
      unique_lock<mutex> lck{mmutex};
      mqueue.push(m);
      mcond.notify_one();
    }
  }
#+END_SRC

=<future>=:
1. future and promise
2. packaged_task
3. async()

#+BEGIN_SRC c++
  void f(promise<X> &px) {
    try {
      X res; // ...
      px.set_value(res);
    } catch (...) {
      px.set_exception(current_exception()); // pass the exception
    }
  }
  void g(future<X> &fx) { X v = fx.get(); /* block */ }
#+END_SRC

The packaged_task type is provided to simplify setting up tasks
connected with futures and promises to be run on threads:
#+BEGIN_SRC c++
  double accum(double∗ beg, double∗ end, double init) {
    return accumulate(beg, end, init);
  }
  double sum(vector<double>& v) {
    using Task_type = double(double∗, double∗, double); // accumulate
    packaged_task<Task_type> pt0{accum};
    packaged_task<Task_type> pt1{accum};
    future<double> f0{pt0.get_future()};
    future<double> f1{pt1.get_future()};

    double∗ first = &v[0];
    thread t1{move(pt0), first, first + v.size() / 2, 0};
    thread t2{move(pt1), first + v.size() / 2, first + v.size(), 0};
    return f0.get() + f1.get();
  }
#+END_SRC

Using =async()=, you don’t have to think about threads and locks.
Instead, you think just in terms of tasks that potentially compute their results asynchronously:
#+BEGIN_SRC c++
  auto v0 = &v[0]; auto sz = v.size();
  auto f0 = async(accum, v0, v0 + sz / 4, 0.0);
  auto f1 = async(accum, v0 + sz / 4, v0 + sz / 2, 0.0);
  auto f2 = async(accum, v0 + sz / 2, v0 + sz∗3 / 4, 0.0);
  auto f3 = async(accum, v0 + sz∗3 / 4, v0 + sz, 0.0);
  // f0.get() + f1.get() + f2.get() + f3.get();
#+END_SRC
