cpp.html

<div id="outline-container-org04a31e7" class="outline-2">
<h2 id="org04a31e7"><span class="section-number-2">12.</span> Numerics</h2>
<div class="outline-text-2" id="text-12">
<p>
<code>&lt;math&gt;</code> for float, double, long double :
abs(x), ceil(x), floor(x), sqrt(x), cos(x), sin(x),
tan(x), acos(x), asin(x), sinh(x), cosh(x), tanh(x),
exp(x), log(x).
</p>

<p>
The versions for <code>complex</code> are found in <code>&lt;complex&gt;</code>.
</p>

<p>
Errors are reported by setting errno from <code>&lt;cerrno&gt;</code> to <code>EDOM</code>
for a domain error and to <code>ERANGE</code> for a range error:
</p>
<div class="org-src-container">
<pre class="src src-c++">  errno = 0; // clear old error state
  // ...
  if (errno == EDOM) cerr &lt;&lt; "domain error";
  if (errno == ERANGE) cerr &lt;&lt; "range error";
</pre>
</div>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 3:</span> Numerical Algorithms in <code>&lt;numeric&gt;</code></caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">x=accumulate(b,e,i)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">x=accumulate(b,e,i,f)</td>
<td class="org-left">using f instead of +</td>
</tr>

<tr>
<td class="org-left">x=inner_product(b,e,b2,i)</td>
<td class="org-left">inner product of [b:e) and [b2:b2+(e−b)), i is initial value</td>
</tr>

<tr>
<td class="org-left">x=inner_product(b,e,b2,i,f,f2)</td>
<td class="org-left">using f and f2 instead of + and *</td>
</tr>

<tr>
<td class="org-left">p=partial_sum(b,e,out)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">p=partial_sum(b,e,out,f)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">p=adjacent_difference(b,e,out)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">p=adjacent_difference(b,e,out,f)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">iota(b,e,v)</td>
<td class="org-left">For each element in [b:e) assign ++v: v+1, v+2, &#x2026;</td>
</tr>
</tbody>
</table>

<p>
A random number generator consists of two parts:
</p>
<ol class="org-ol">
<li>an <b>engine</b> that produces a sequence of random or pseudo-random values.</li>
<li>a <b>distribution</b> that maps those values into a mathematical distribution in a range.</li>
</ol>

<div class="org-src-container">
<pre class="src src-c++">  auto die = bind(uniform_int_distribution&lt;&gt;{1, 6},
                  default_random_engine{});
  int x = die();
</pre>
</div>

<p>
<code>valarray</code> in <code>&lt;valarray&gt;</code>  is less general and
more amenable to <b>optimization for numerical computation</b>.
</p>

<p>
Properties of numeric types are accessible through numeric_limits.
Use numeric_limits to check that the numeric types are adequate for their use.
</p>
</div>
</div>

<div id="outline-container-org92a1b7a" class="outline-2">
<h2 id="org92a1b7a"><span class="section-number-2">13.</span> Concurrency</h2>
<div class="outline-text-2" id="text-13">
<p>
threads, mutexes, lock() operations, packaged_tasks, and futures.
</p>

<p>
<b>task</b> s a computation that can potentially be executed concurrently with other computations.
A <b>thread</b> is the system-level representation of a task in a program.
</p>

<p>
A task is a function or a function object and launched as argument
by constructing a <code>std::thread</code> (found in <code>&lt;thread&gt;</code>).
</p>

<div class="org-src-container">
<pre class="src src-c++">  void f();  // function
  struct F { // function object
    void operator()();
  };
  void user() {
    thread t1{f};
    thread t2{F()};
    t1.join(); // wait for t1
    t2.join(); // wait for t2
  }
</pre>
</div>

<p>
To <code>join</code> a thread means to wait for the thread to terminate.
</p>

<p>
Threads of a program <b>share a single address space</b>.
In this, threads differ from processes, which generally do not directly share data.
Since threads share an address space, they can communicate through shared objects.
</p>

<p>
The <code>ref()</code> is a type function from <code>&lt;functional&gt;</code> that unfortunately is needed
to tell the variadic template to treat some_vec as a reference,
rather than as an object.
</p>
<div class="org-src-container">
<pre class="src src-c++">  void f(vector&lt;double&gt; &amp;v);
  thread t1{f, ref(some_vec)};
</pre>
</div>

<p>
pass the input data by const reference and to
pass the location of a place to deposit the result as a separate argument:
</p>
<div class="org-src-container">
<pre class="src src-c++">  void f(const vector&lt;double&gt; &amp;v, double *res);
  thread t1{f, cref(some_vec), &amp;res1};
</pre>
</div>
<p>
<code>cref</code> is for <code>const</code>.
</p>

<p>
A <code>mutex</code> in <code>&lt;mutex&gt;</code> is a mutual exclusion object.
A thread acquires a mutex using a <code>lock()</code> operation:
</p>
<div class="org-src-container">
<pre class="src src-c++">  mutex m;
  int sh;
  void f() {
    unique_lock&lt;mutex&gt; lck{m};
    sh += 7;
  } // release mutex implicitly
</pre>
</div>
<p>
The <code>unique_lock</code> releases the mutex with a call <code>m.unlock()</code>.
</p>

<p>
Acquiring several locks simultaneously to avoid deadlock:
</p>
<div class="org-src-container">
<pre class="src src-c++">  unique_lock&lt;mutex&gt; lck1 {m1,defer_lock};
  unique_lock&lt;mutex&gt; lck2 {m2,defer_lock};
  unique_lock&lt;mutex&gt; lck3 {m3,defer_lock};
  // ...
  lock(lck1,lck2,lck3);
</pre>
</div>

<p>
Sleep:
</p>
<div class="org-src-container">
<pre class="src src-c++">  using namespace std::chrono;
  this_thread::sleep_for(milliseconds{20});
</pre>
</div>

<p>
The basic support for communicating using external events
is provided by condition_variables found in <code>&lt;condition_variable&gt;</code>.
A <code>condition_variable</code> is a mechanism allowing one thread to wait for another:
</p>
<div class="org-src-container">
<pre class="src src-c++">  queue&lt;Message&gt; mqueue;
  condition_variable mcond;
  mutex mmutex;

  void consumer() {
    while (true) {
      unique_lock&lt;mutex&gt; lck{mmutex};
      while (mcond.wait(lck))
        /* do nothing */;
      auto m = mqueue.front();
      mqueue.pop();
      lck.unlock();
      // process m...
    }
  }
  void producer() {
    while (true) {
      Message m;
      // ... fill the message ...
      unique_lock&lt;mutex&gt; lck{mmutex};
      mqueue.push(m);
      mcond.notify_one();
    }
  }
</pre>
</div>

<p>
<code>&lt;future&gt;</code>:
</p>
<ol class="org-ol">
<li>future and promise</li>
<li>packaged_task</li>
<li>async()</li>
</ol>

<div class="org-src-container">
<pre class="src src-c++">  void f(promise&lt;X&gt; &amp;px) {
    try {
      X res; // ...
      px.set_value(res);
    } catch (...) {
      px.set_exception(current_exception()); // pass the exception
    }
  }
  void g(future&lt;X&gt; &amp;fx) { X v = fx.get(); /* block */ }
</pre>
</div>

<p>
The packaged_task type is provided to simplify setting up tasks
connected with futures and promises to be run on threads:
</p>
<div class="org-src-container">
<pre class="src src-c++">  double accum(double∗ beg, double∗ end, double init) {
    return accumulate(beg, end, init);
  }
  double sum(vector&lt;double&gt;&amp; v) {
    using Task_type = double(double∗, double∗, double); // accumulate
    packaged_task&lt;Task_type&gt; pt0{accum};
    packaged_task&lt;Task_type&gt; pt1{accum};
    future&lt;double&gt; f0{pt0.get_future()};
    future&lt;double&gt; f1{pt1.get_future()};

    double∗ first = &amp;v[0];
    thread t1{move(pt0), first, first + v.size() / 2, 0};
    thread t2{move(pt1), first + v.size() / 2, first + v.size(), 0};
    return f0.get() + f1.get();
  }
</pre>
</div>

<p>
Using <code>async()</code>, you don’t have to think about threads and locks.
Instead, you think just in terms of tasks that potentially compute their results asynchronously:
</p>
<div class="org-src-container">
<pre class="src src-c++">  auto v0 = &amp;v[0]; auto sz = v.size();
  auto f0 = async(accum, v0, v0 + sz / 4, 0.0);
  auto f1 = async(accum, v0 + sz / 4, v0 + sz / 2, 0.0);
  auto f2 = async(accum, v0 + sz / 2, v0 + sz∗3 / 4, 0.0);
  auto f3 = async(accum, v0 + sz∗3 / 4, v0 + sz, 0.0);
  // f0.get() + f1.get() + f2.get() + f3.get();
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: scturtle</p>
<p class="date">Created: 2023-06-14 Wed 17:59</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>